package ua.artocde.week3;
//Написать метод, который проверяет является ли строка палиндромом

import ua.artocde.method.MatrixUtils;

/**
 * Created by Влад on 27.10.2017.
 */
public class Work4 {
    public static void main(String[] args) {

          /*
          * строка - баба
          * строкаНавпаки = розвернута задом наперед "строка" --- абаб
          * результат = stroka.equals(strokaNavpaky);
          *
          * */
        System.out.println(MatrixUtils.palindrome("olo olo olo"));
//        System.out.println((char) 85);
    }
}
