package ua.artocde.week1.gy;

public class HelloWorld {

    //Пользователь вводит параметр с консоли (текущий час от 0 до 24)
//Если время от 9 до 18, то выводим "Я на работе", в другом случае "Я отдыхаю")


    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {

            if (i > 5) {
                break;
            }
            System.out.println(i);


        }
    }
}




